-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_7b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:26:54

. xttobit prop_emne_capital_excl_col_link voice_and_acc pol_stability govt_effectiveness reg_qu
> ality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capit
> a geographic_proximity, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -154.29944  
Iteration 1:  Log likelihood = -146.86749  
Iteration 2:  Log likelihood = -146.07744  
Iteration 3:  Log likelihood = -146.07575  
Iteration 4:  Log likelihood = -146.07575  

Fitting full model:

Iteration 0:  Log likelihood = -144.13691  
Iteration 1:  Log likelihood = -137.44762  
Iteration 2:  Log likelihood = -137.22191  
Iteration 3:  Log likelihood = -137.22132  
Iteration 4:  Log likelihood = -137.22132  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -220.14848
Iteration 1:  Log likelihood = -219.61141
Iteration 2:  Log likelihood = -219.32722
Iteration 3:  Log likelihood = -219.31948
Iteration 4:  Log likelihood = -219.31947

Fitting full model:

Iteration 0:  Log likelihood = -147.73158  (not concave)
Iteration 1:  Log likelihood = -140.74071  (not concave)
Iteration 2:  Log likelihood =  -139.4521  
Iteration 3:  Log likelihood = -137.44578  
Iteration 4:  Log likelihood =  -137.2224  
Iteration 5:  Log likelihood = -137.22132  
Iteration 6:  Log likelihood = -137.22132  

Random-effects tobit regression                     Number of obs     =     44
                                                           Uncensored =     22
Limits: Lower =   0                                     Left-censored =      7
        Upper = 100                                    Right-censored =     15

Group variable: country_id                          Number of groups  =     22
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(10)     =  13.86
Log likelihood = -137.22132                         Prob > chi2       = 0.1794

----------------------------------------------------------------------------------------------
prop_emne_capital_excl_col~k | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
               voice_and_acc |   18.22981   22.00743     0.83   0.407    -24.90396    61.36358
               pol_stability |   66.25985   28.08413     2.36   0.018     11.21597    121.3037
          govt_effectiveness |  -63.43825   57.24565    -1.11   0.268    -175.6377    48.76116
                 reg_quality |  -159.4051   87.50788    -1.82   0.069    -330.9173    12.10724
                 rule_of_law |  -125.4272   72.07458    -1.74   0.082    -266.6908    15.83634
       control_of_corruption |   162.5997   61.39279     2.65   0.008     42.27204    282.9273
              gni_per_capita |  -.0065508   .0241211    -0.27   0.786    -.0538273    .0407257
        broadband_per_capita |   19.49957   23.91188     0.82   0.415    -27.36686      66.366
          mobiles_per_capita |    .241889   .4200743     0.58   0.565    -.5814415    1.065219
        geographic_proximity |   6.678911    24.3578     0.27   0.784     -41.0615    54.41932
                       _cons |  -40.77648   58.82909    -0.69   0.488    -156.0794    74.52643
-----------------------------+----------------------------------------------------------------
                    /sigma_u |   5.33e-15   28.79383     0.00   1.000    -56.43488    56.43488
                    /sigma_e |    60.5901   10.29531     5.89   0.000     40.41167    80.76853
-----------------------------+----------------------------------------------------------------
                         rho |   7.73e-33   8.36e-17                             0           1
----------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_7b_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_7b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_7b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:26:54
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_7b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:26:54

. tobit prop_emne_capital_excl_col_link voice_and_acc pol_stability govt_effectiveness reg_qual
> ity rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita 
> geographic_proximity, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -147.73158

Fitting full model:

Iteration 0:  Log likelihood = -147.73158  
Iteration 1:  Log likelihood = -138.53839  
Iteration 2:  Log likelihood = -137.33381  
Iteration 3:  Log likelihood = -137.22217  
Iteration 4:  Log likelihood = -137.22132  
Iteration 5:  Log likelihood = -137.22132  

Tobit regression                                    Number of obs     =     44
                                                           Uncensored =     22
Limits: Lower =   0                                     Left-censored =      7
        Upper = 100                                    Right-censored =     15

                                                    LR chi2(10)       =  17.71
                                                    Prob > chi2       = 0.0601
Log likelihood = -137.22132                         Pseudo R2         = 0.0606

----------------------------------------------------------------------------------------------
prop_emne_capital_excl_col~k | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
               voice_and_acc |   18.22981   22.00743     0.83   0.413    -26.49467    62.95429
               pol_stability |   66.25985   28.08413     2.36   0.024     9.186031    123.3337
          govt_effectiveness |  -63.43825   57.24565    -1.11   0.276    -179.7754    52.89891
                 reg_quality |  -159.4051   87.50788    -1.82   0.077    -337.2425    18.43236
                 rule_of_law |  -125.4272   72.07458    -1.74   0.091    -271.9004    21.04594
       control_of_corruption |   162.5997   61.39279     2.65   0.012     37.83453    287.3648
              gni_per_capita |  -.0065508   .0241211    -0.27   0.788    -.0555708    .0424692
        broadband_per_capita |   19.49957   23.91188     0.82   0.420    -29.09523    68.09436
          mobiles_per_capita |    .241889   .4200743     0.58   0.569    -.6118047    1.095583
        geographic_proximity |   6.678911    24.3578     0.27   0.786     -42.8221    56.17992
                       _cons |  -40.77648    58.8291    -0.69   0.493    -160.3316    78.77863
-----------------------------+----------------------------------------------------------------
var(e.prop_emne_capital_ex~k)|    3671.16   1247.587                      1840.212     7323.84
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_7b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:26:54
-----------------------------------------------------------------------------------------------
