----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  20 Dec 2024, 23:48:52

. xttobit prop_emne_capital voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_p
> er_capita geographic_proximity, ll(0) ul(1) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -56.218521  
Iteration 1:  Log likelihood = -49.495476  
Iteration 2:  Log likelihood = -48.943797  
Iteration 3:  Log likelihood = -48.943794  

Fitting full model:

Iteration 0:  Log likelihood = -48.832818  
Iteration 1:  Log likelihood = -44.058797  
Iteration 2:  Log likelihood = -43.901531  
Iteration 3:  Log likelihood = -43.901122  
Iteration 4:  Log likelihood = -43.901122  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -22.350436
Iteration 1:  Log likelihood = -21.794439
Iteration 2:  Log likelihood =  -21.60697
Iteration 3:  Log likelihood = -21.603643
Iteration 4:  Log likelihood = -21.603642

Fitting full model:

Iteration 0:  Log likelihood = -52.345948  (not concave)
Iteration 1:  Log likelihood = -45.418814  
Iteration 2:  Log likelihood = -43.970859  
Iteration 3:  Log likelihood = -43.901166  
Iteration 4:  Log likelihood = -43.901122  
Iteration 5:  Log likelihood = -43.901122  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower = 0                                       Left-censored =      9
        Upper = 1                                      Right-censored =     13

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(10)     =   9.46
Log likelihood = -43.901122                         Prob > chi2       = 0.4895

---------------------------------------------------------------------------------------
    prop_emne_capital | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
        voice_and_acc |   .0466824   .2106203     0.22   0.825    -.3661259    .4594906
        pol_stability |   .2601943   .2362002     1.10   0.271    -.2027497    .7231382
   govt_effectiveness |  -.6293687    .534092    -1.18   0.239     -1.67617    .4174324
          reg_quality |  -.9932211   .7459252    -1.33   0.183    -2.455208    .4687654
          rule_of_law |  -.1487469   .5291009    -0.28   0.779    -1.185766    .8882718
control_of_corruption |    .672244   .4491294     1.50   0.134    -.2080334    1.552521
       gni_per_capita |  -.0001648   .0002255    -0.73   0.465    -.0006069    .0002772
 broadband_per_capita |   .0852986    .222021     0.38   0.701    -.3498545    .5204517
   mobiles_per_capita |   .0023394   .0038967     0.60   0.548     -.005298    .0099767
 geographic_proximity |   .1529994   .2342086     0.65   0.514     -.306041    .6120398
                _cons |  -.2139331   .5344221    -0.40   0.689    -1.261381     .833515
----------------------+----------------------------------------------------------------
             /sigma_u |   3.72e-18    .169968     0.00   1.000    -.3331312    .3331312
             /sigma_e |   .6278045   .0980998     6.40   0.000     .4355324    .8200766
----------------------+----------------------------------------------------------------
                  rho |   3.51e-35   3.21e-18                             0           1
---------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)

. esttab re_model using "../results/model_3b_results.csv", replace title("Random Effects Panel Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_3b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  20 Dec 2024, 23:48:52
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3b_replication.log
  log type:  text
 opened on:  20 Dec 2024, 23:48:52

. tobit prop_emne_capital voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per
> _capita geographic_proximity, ll(0) ul(1)

Refining starting values:

Grid node 0:  Log likelihood = -52.345948

Fitting full model:

Iteration 0:  Log likelihood = -52.345948  
Iteration 1:  Log likelihood = -44.631593  
Iteration 2:  Log likelihood = -43.928539  
Iteration 3:  Log likelihood = -43.901143  
Iteration 4:  Log likelihood = -43.901122  
Iteration 5:  Log likelihood = -43.901122  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower = 0                                       Left-censored =      9
        Upper = 1                                      Right-censored =     13

                                                    LR chi2(10)       =  10.09
                                                    Prob > chi2       = 0.4330
Log likelihood = -43.901122                         Pseudo R2         = 0.1030

------------------------------------------------------------------------------------------
       prop_emne_capital | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
           voice_and_acc |   .0466824   .2106203     0.22   0.826    -.3796962    .4730609
           pol_stability |   .2601943   .2362002     1.10   0.278    -.2179681    .7383566
      govt_effectiveness |  -.6293687    .534092    -1.18   0.246    -1.710581    .4518441
             reg_quality |  -.9932211   .7459252    -1.33   0.191    -2.503268    .5168255
             rule_of_law |  -.1487469   .5291009    -0.28   0.780    -1.219856    .9223618
   control_of_corruption |    .672244   .4491294     1.50   0.143    -.2369709    1.581459
          gni_per_capita |  -.0001648   .0002255    -0.73   0.469    -.0006214    .0002917
    broadband_per_capita |   .0852986    .222021     0.38   0.703    -.3641593    .5347566
      mobiles_per_capita |   .0023394   .0038967     0.60   0.552     -.005549    .0102277
    geographic_proximity |   .1529994   .2342086     0.65   0.518    -.3211312    .6271299
                   _cons |  -.2139331   .5344221    -0.40   0.691    -1.295814    .8679479
-------------------------+----------------------------------------------------------------
 var(e.prop_emne_capital)|   .3941385    .123175                      .2093578     .742008
------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3b_replication.log
  log type:  text
 closed on:  20 Dec 2024, 23:48:53
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
