-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_4b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:25:34

. xttobit prop_emne_excl_qst_source voice_and_acc pol_stability govt_effectiveness reg_quality 
> rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita geog
> raphic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -202.76408  
Iteration 1:  Log likelihood = -199.85463  
Iteration 2:  Log likelihood = -199.78908  
Iteration 3:  Log likelihood = -199.78903  
Iteration 4:  Log likelihood = -199.78903  

Fitting full model:

Iteration 0:  Log likelihood = -188.17735  
Iteration 1:  Log likelihood = -186.04342  
Iteration 2:  Log likelihood = -186.03554  
Iteration 3:  Log likelihood = -186.03554  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -228.36413
Iteration 1:  Log likelihood = -227.76323
Iteration 2:  Log likelihood = -227.50888
Iteration 3:  Log likelihood = -227.50322
Iteration 4:  Log likelihood = -227.50321

Fitting full model:

Iteration 0:  Log likelihood = -190.20659  (not concave)
Iteration 1:  Log likelihood = -187.01235  
Iteration 2:  Log likelihood = -186.06504  
Iteration 3:  Log likelihood = -186.03561  
Iteration 4:  Log likelihood = -186.03554  
Iteration 5:  Log likelihood = -186.03554  

Random-effects tobit regression                     Number of obs     =     50
                                                           Uncensored =     36
Limits: Lower =   0                                     Left-censored =      5
        Upper = 100                                    Right-censored =      9

Group variable: country_id                          Number of groups  =     25
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  28.45
Log likelihood = -186.03554                         Prob > chi2       = 0.0028

-------------------------------------------------------------------------------------------
prop_emne_excl_qst_source | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
            voice_and_acc |   1.466771   10.59898     0.14   0.890    -19.30684    22.24038
            pol_stability |   31.68918   11.59364     2.73   0.006     8.966057    54.41231
       govt_effectiveness |  -20.94161    22.3627    -0.94   0.349    -64.77169    22.88847
              reg_quality |  -6.676154   34.65923    -0.19   0.847      -74.607    61.25469
              rule_of_law |  -49.28551   24.87157    -1.98   0.048    -98.03289   -.5381379
    control_of_corruption |   35.35734   20.75643     1.70   0.088    -5.324529     76.0392
           gni_per_capita |   -.018468   .0107174    -1.72   0.085    -.0394737    .0025378
     broadband_per_capita |   22.66425   11.53152     1.97   0.049      .062891    45.26561
       mobiles_per_capita |  -.3868013   .1981407    -1.95   0.051      -.77515    .0015474
     geographic_proximity |   .8782836   10.13284     0.09   0.931    -18.98171    20.73828
            colonial_link |  -46.39948   12.85156    -3.61   0.000    -71.58807   -21.21089
                    _cons |   100.1402   33.01454     3.03   0.002     35.43288    164.8475
--------------------------+----------------------------------------------------------------
                 /sigma_u |   6.14e-15   8.757491     0.00   1.000    -17.16437    17.16437
                 /sigma_e |   30.09825   3.828558     7.86   0.000     22.59441    37.60209
--------------------------+----------------------------------------------------------------
                      rho |   4.16e-32   1.19e-16                             0           1
-------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_4b_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_4b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_4b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:25:34
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_4b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:25:34

. tobit prop_emne_excl_qst_source voice_and_acc pol_stability govt_effectiveness reg_quality ru
> le_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita geogra
> phic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -190.20659

Fitting full model:

Iteration 0:  Log likelihood = -190.20659  
Iteration 1:  Log likelihood = -186.28252  
Iteration 2:  Log likelihood = -186.03905  
Iteration 3:  Log likelihood = -186.03554  
Iteration 4:  Log likelihood = -186.03554  

Tobit regression                                    Number of obs     =     50
                                                           Uncensored =     36
Limits: Lower =   0                                     Left-censored =      5
        Upper = 100                                    Right-censored =      9

                                                    LR chi2(11)       =  27.51
                                                    Prob > chi2       = 0.0038
Log likelihood = -186.03554                         Pseudo R2         = 0.0688

----------------------------------------------------------------------------------------------
   prop_emne_excl_qst_source | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
               voice_and_acc |    1.46677   10.59898     0.14   0.891    -19.97168    22.90522
               pol_stability |   31.68918   11.59364     2.73   0.009     8.238824    55.13954
          govt_effectiveness |  -20.94161   22.36269    -0.94   0.355    -66.17443    24.29121
                 reg_quality |  -6.676154   34.65923    -0.19   0.848    -76.78106    63.42875
                 rule_of_law |  -49.28551   24.87157    -1.98   0.055      -99.593    1.021978
       control_of_corruption |   35.35733   20.75643     1.70   0.096    -6.626515    77.34118
              gni_per_capita |   -.018468   .0107174    -1.72   0.093     -.040146    .0032101
        broadband_per_capita |   22.66425   11.53152     1.97   0.057     -.660445    45.98894
          mobiles_per_capita |  -.3868013   .1981407    -1.95   0.058    -.7875787    .0139762
        geographic_proximity |   .8782838   10.13284     0.09   0.931    -19.61731    21.37388
               colonial_link |  -46.39948   12.85156    -3.61   0.001     -72.3942   -20.40475
                       _cons |   100.1402   33.01454     3.03   0.004     33.36198    166.9184
-----------------------------+----------------------------------------------------------------
var(e.prop_emne_excl_qst_s~e)|   905.9046   230.4658                      541.5055    1515.521
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_4b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:25:35
-----------------------------------------------------------------------------------------------
