-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2a_replication.log
  log type:  text
 opened on:  19 Dec 2024, 12:52:12

. xttobit prop_emne_excl_nat_res gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity colonial_link, ll(0) ul(1) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -41.682702  
Iteration 1:  Log likelihood = -37.753356  
Iteration 2:  Log likelihood = -37.612174  
Iteration 3:  Log likelihood =  -37.61188  
Iteration 4:  Log likelihood =  -37.61188  

Fitting full model:

Iteration 0:  Log likelihood =  -34.59821  
Iteration 1:  Log likelihood = -31.483824  
Iteration 2:  Log likelihood = -31.426472  
Iteration 3:  Log likelihood = -31.426428  
Iteration 4:  Log likelihood = -31.426428  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -6.5012765
Iteration 1:  Log likelihood = -6.3050599
Iteration 2:  Log likelihood = -6.2965319
Iteration 3:  Log likelihood = -6.2965231

Fitting full model:

Iteration 0:  Log likelihood = -36.095934  (not concave)
Iteration 1:  Log likelihood = -31.644062  
Iteration 2:  Log likelihood = -31.428305  
Iteration 3:  Log likelihood = -31.426429  
Iteration 4:  Log likelihood = -31.426428  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     32
Limits: Lower = 0                                       Left-censored =      6
        Upper = 1                                      Right-censored =     10

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =  12.79
Log likelihood = -31.426428                         Prob > chi2       = 0.0254

----------------------------------------------------------------------------------------
prop_emne_excl_nat_res | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
        gni_per_capita |   -.000054   .0001157    -0.47   0.641    -.0002808    .0001728
  broadband_per_capita |   .1335582   .1398841     0.95   0.340    -.1406096     .407726
    mobiles_per_capita |  -.0012954   .0018458    -0.70   0.483    -.0049132    .0023223
  geographic_proximity |   .0479001    .129224     0.37   0.711    -.2053743    .3011746
         colonial_link |  -.4193164   .1250542    -3.35   0.001    -.6644181   -.1742148
                 _cons |   .8512149   .1849025     4.60   0.000     .4888126    1.213617
-----------------------+----------------------------------------------------------------
              /sigma_u |   3.75e-17   .1468106     0.00   1.000    -.2877435    .2877435
              /sigma_e |    .392765   .0542392     7.24   0.000     .2864581    .4990719
-----------------------+----------------------------------------------------------------
                   rho |   9.13e-33   7.14e-17                             0           1
----------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2a_replication.log
  log type:  text
 closed on:  19 Dec 2024, 12:52:13
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2a_replication.log
  log type:  text
 opened on:  19 Dec 2024, 12:52:13

. tobit prop_emne_excl_nat_res gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity colonial_link, ll(0) ul(1)

Refining starting values:

Grid node 0:  Log likelihood = -36.095934

Fitting full model:

Iteration 0:  Log likelihood = -36.095934  
Iteration 1:  Log likelihood = -31.699341  
Iteration 2:  Log likelihood = -31.429708  
Iteration 3:  Log likelihood = -31.426433  
Iteration 4:  Log likelihood = -31.426428  
Iteration 5:  Log likelihood = -31.426428  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     32
Limits: Lower = 0                                       Left-censored =      6
        Upper = 1                                      Right-censored =     10

                                                    LR chi2(5)        =  12.37
                                                    Prob > chi2       = 0.0300
Log likelihood = -31.426428                         Pseudo R2         = 0.1645

-----------------------------------------------------------------------------------------------
       prop_emne_excl_nat_res | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
               gni_per_capita |   -.000054   .0001157    -0.47   0.643    -.0002873    .0001794
         broadband_per_capita |   .1335582   .1398841     0.95   0.345     -.148545    .4156614
           mobiles_per_capita |  -.0012954   .0018458    -0.70   0.487    -.0050179    .0024271
         geographic_proximity |   .0479001    .129224     0.37   0.713     -.212705    .3085052
                colonial_link |  -.4193165   .1250542    -3.35   0.002    -.6715122   -.1671207
                        _cons |   .8512149   .1849026     4.60   0.000     .4783234    1.224106
------------------------------+----------------------------------------------------------------
 var(e.prop_emne_excl_nat_res)|   .1542644   .0426065                      .0883825    .2692557
-----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2a_replication.log
  log type:  text
 closed on:  19 Dec 2024, 12:52:13
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2a_replication.log
  log type:  text
 opened on:  19 Dec 2024, 12:52:13

. summarize prop_emne_excl_nat_res gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emne_~s |         48    .5633968    .3184471          0          1
gni_per_ca~a |         48    986.7947    634.1725   278.1263   2862.964
broadband_~a |         48    .3680235    .5504087   .0011483    2.33941
mobiles_pe~a |         48    72.70814    33.48636   23.52311   128.0767
geographic~y |         48    .3958333     .494204          0          1
-------------+---------------------------------------------------------
colonial_l~k |         48       .4375     .501328          0          1

. pwcorr prop_emne_excl_nat_res gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity colonial_link, star(0.05)

             | prop_e~s gni_pe~a broadb~a mobile~a geogra~y coloni~k
-------------+------------------------------------------------------
prop_emne_~s |   1.0000 
gni_per_ca~a |   0.0381   1.0000 
broadband_~a |   0.0721   0.5208*  1.0000 
mobiles_pe~a |  -0.1056   0.0854   0.0774   1.0000 
geographic~y |   0.1336  -0.0468   0.2489   0.1306   1.0000 
colonial_l~k |  -0.4475* -0.0780   0.1219   0.1100  -0.0268   1.0000 

. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2a_replication.log
  log type:  text
 closed on:  19 Dec 2024, 12:52:13
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
