-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_8a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:27:07

. xttobit prop_emne_cap_excl_qst_src gni_per_capita broadband_per_capita mobiles_per_capita geo
> graphic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -175.94854  
Iteration 1:  Log likelihood = -169.22474  
Iteration 2:  Log likelihood = -168.67284  
Iteration 3:  Log likelihood = -168.67284  

Fitting full model:

Iteration 0:  Log likelihood = -170.60401  
Iteration 1:  Log likelihood = -164.94839  
Iteration 2:  Log likelihood =  -164.6537  
Iteration 3:  Log likelihood = -164.65331  
Iteration 4:  Log likelihood = -164.65331  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -243.62281
Iteration 1:  Log likelihood = -243.42659
Iteration 2:  Log likelihood = -243.41806
Iteration 3:  Log likelihood = -243.41806

Fitting full model:

Iteration 0:  Log likelihood = -172.62023  (not concave)
Iteration 1:  Log likelihood = -164.82297  
Iteration 2:  Log likelihood =  -164.6596  
Iteration 3:  Log likelihood = -164.65332  
Iteration 4:  Log likelihood = -164.65331  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =      9
        Upper = 100                                    Right-censored =     13

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =   8.00
Log likelihood = -164.65331                         Prob > chi2       = 0.1565

--------------------------------------------------------------------------------------------
prop_emne_cap_excl_qst_src | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------------+----------------------------------------------------------------
            gni_per_capita |  -.0119757   .0191568    -0.63   0.532    -.0495224     .025571
      broadband_per_capita |   11.02367   22.21528     0.50   0.620    -32.51748    54.56481
        mobiles_per_capita |   .0431817   .3163868     0.14   0.891    -.5769251    .6632885
      geographic_proximity |   10.00798   22.40964     0.45   0.655    -33.91412    53.93007
             colonial_link |  -60.70173   21.97192    -2.76   0.006    -103.7659   -17.63757
                     _cons |   84.82683   28.82008     2.94   0.003     28.34052    141.3131
---------------------------+----------------------------------------------------------------
                  /sigma_u |   2.59e-14   46.51356     0.00   1.000     -91.1649     91.1649
                  /sigma_e |   63.99081   9.994093     6.40   0.000     44.40275    83.57887
---------------------------+----------------------------------------------------------------
                       rho |   1.64e-31   5.89e-16                             0           1
--------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_8a_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_8a_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_8a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:27:07
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_8a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:27:07

. tobit prop_emne_cap_excl_qst_src gni_per_capita broadband_per_capita mobiles_per_capita geogr
> aphic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -172.62023

Fitting full model:

Iteration 0:  Log likelihood = -172.62023  
Iteration 1:  Log likelihood =  -165.2773  
Iteration 2:  Log likelihood = -164.66982  
Iteration 3:  Log likelihood = -164.65333  
Iteration 4:  Log likelihood = -164.65331  
Iteration 5:  Log likelihood = -164.65331  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =      9
        Upper = 100                                    Right-censored =     13

                                                    LR chi2(5)        =   8.04
                                                    Prob > chi2       = 0.1541
Log likelihood = -164.65331                         Pseudo R2         = 0.0238

----------------------------------------------------------------------------------------------
  prop_emne_cap_excl_qst_src | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
              gni_per_capita |  -.0119757   .0191568    -0.63   0.535    -.0506091    .0266578
        broadband_per_capita |   11.02367    22.2153     0.50   0.622    -33.77775    55.82509
          mobiles_per_capita |    .043182   .3163871     0.14   0.892    -.5948734    .6812374
        geographic_proximity |   10.00798   22.40966     0.45   0.657    -35.18541    55.20137
               colonial_link |  -60.70175   21.97194    -2.76   0.008    -105.0124   -16.39112
                       _cons |   84.82681    28.8201     2.94   0.005     26.70554    142.9481
-----------------------------+----------------------------------------------------------------
var(e.prop_emne_cap_excl_q~c)|   4094.831   1279.064                      2181.014    7687.999
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_8a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:27:07
-----------------------------------------------------------------------------------------------
