-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3b_replication.log
  log type:  text
 opened on:  26 Dec 2024, 12:43:56

. xttobit prop_emne_excl_col_link voice_and_acc pol_stability govt_effectiveness reg_quality ru
> le_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita geogra
> phic_proximity, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -189.60749  
Iteration 1:  Log likelihood = -186.08008  
Iteration 2:  Log likelihood = -185.97993  
Iteration 3:  Log likelihood =  -185.9798  
Iteration 4:  Log likelihood =  -185.9798  

Fitting full model:

Iteration 0:  Log likelihood = -179.64045  
Iteration 1:  Log likelihood = -176.93118  
Iteration 2:  Log likelihood = -176.89842  
Iteration 3:  Log likelihood = -176.89839  
Iteration 4:  Log likelihood = -176.89839  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -223.43112
Iteration 1:  Log likelihood = -222.87512
Iteration 2:  Log likelihood = -222.68765
Iteration 3:  Log likelihood = -222.68433
Iteration 4:  Log likelihood = -222.68433

Fitting full model:

Iteration 0:  Log likelihood = -181.84762  (not concave)
Iteration 1:  Log likelihood = -178.31766  
Iteration 2:  Log likelihood = -176.93671  
Iteration 3:  Log likelihood =  -176.8985  
Iteration 4:  Log likelihood = -176.89839  
Iteration 5:  Log likelihood = -176.89839  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     33
Limits: Lower =   0                                     Left-censored =      4
        Upper = 100                                    Right-censored =     11

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(10)     =  16.66
Log likelihood = -176.89839                         Prob > chi2       = 0.0824

-----------------------------------------------------------------------------------------
prop_emne_excl_col_link | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
          voice_and_acc |   -.080232   11.65115    -0.01   0.995    -22.91608    22.75561
          pol_stability |   26.21372   12.99412     2.02   0.044     .7457185    51.68172
     govt_effectiveness |  -32.82521   27.10091    -1.21   0.226    -85.94202     20.2916
            reg_quality |   -30.8573   42.49222    -0.73   0.468    -114.1405    52.42593
            rule_of_law |   -64.3192   35.46483    -1.81   0.070     -133.829    5.190594
  control_of_corruption |   59.65799   30.35741     1.97   0.049      .158551    119.1574
         gni_per_capita |  -.0002184   .0121851    -0.02   0.986    -.0241007     .023664
   broadband_per_capita |   19.82798   13.45565     1.47   0.141    -6.544604    46.20057
     mobiles_per_capita |  -.2072272   .2179472    -0.95   0.342    -.6343959    .2199414
   geographic_proximity |    4.72359   11.96091     0.39   0.693    -18.71936    28.16654
                  _cons |   28.32054   29.63918     0.96   0.339    -29.77119    86.41227
------------------------+----------------------------------------------------------------
               /sigma_u |   2.95e-15   10.64046     0.00   1.000    -20.85492    20.85492
               /sigma_e |   34.25693   4.601345     7.44   0.000     25.23846    43.27541
------------------------+----------------------------------------------------------------
                    rho |   7.41e-33   5.35e-17                             0           1
-----------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_3b_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_3b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3b_replication.log
  log type:  text
 closed on:  26 Dec 2024, 12:43:57
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3b_replication.log
  log type:  text
 opened on:  26 Dec 2024, 12:43:57

. tobit prop_emne_excl_col_link voice_and_acc pol_stability govt_effectiveness reg_quality rule
> _of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita geograph
> ic_proximity, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -181.84762

Fitting full model:

Iteration 0:  Log likelihood = -181.84762  
Iteration 1:  Log likelihood = -177.23177  
Iteration 2:  Log likelihood = -176.89989  
Iteration 3:  Log likelihood = -176.89839  
Iteration 4:  Log likelihood = -176.89839  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     33
Limits: Lower =   0                                     Left-censored =      4
        Upper = 100                                    Right-censored =     11

                                                    LR chi2(10)       =  18.16
                                                    Prob > chi2       = 0.0523
Log likelihood = -176.89839                         Pseudo R2         = 0.0488

----------------------------------------------------------------------------------------------
     prop_emne_excl_col_link | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
               voice_and_acc |   -.080232   11.65115    -0.01   0.995    -23.66676     23.5063
               pol_stability |   26.21372   12.99412     2.02   0.051     -.091494    52.51893
          govt_effectiveness |  -32.82521   27.10091    -1.21   0.233    -87.68813    22.03771
                 reg_quality |  -30.85729   42.49222    -0.73   0.472    -116.8783    55.16371
                 rule_of_law |  -64.31919   35.46483    -1.81   0.078     -136.114    7.475597
       control_of_corruption |   59.65798   30.35741     1.97   0.057    -1.797381    121.1133
              gni_per_capita |  -.0002184   .0121851    -0.02   0.986    -.0248858    .0244491
        broadband_per_capita |   19.82798   13.45565     1.47   0.149    -7.411553    47.06752
          mobiles_per_capita |  -.2072272   .2179472    -0.95   0.348    -.6484382    .2339837
        geographic_proximity |   4.723589   11.96091     0.39   0.695       -19.49    28.93718
                       _cons |   28.32054   29.63918     0.96   0.345    -31.68084    88.32192
-----------------------------+----------------------------------------------------------------
var(e.prop_emne_excl_col_l~k)|   1173.537   315.2559                      681.2642    2021.521
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3b_replication.log
  log type:  text
 closed on:  26 Dec 2024, 12:43:57
-----------------------------------------------------------------------------------------------
