-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:25:55

. xttobit prop_emne_capital gni_per_capita broadband_per_capita mobiles_per_capita geographic_p
> roximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -175.95295  
Iteration 1:  Log likelihood =  -169.2299  
Iteration 2:  Log likelihood = -168.67822  
Iteration 3:  Log likelihood = -168.67822  

Fitting full model:

Iteration 0:  Log likelihood = -170.60656  
Iteration 1:  Log likelihood = -164.95209  
Iteration 2:  Log likelihood = -164.65754  
Iteration 3:  Log likelihood = -164.65715  
Iteration 4:  Log likelihood = -164.65715  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -243.63806
Iteration 1:  Log likelihood = -243.44184
Iteration 2:  Log likelihood = -243.43331
Iteration 3:  Log likelihood = -243.43331

Fitting full model:

Iteration 0:  Log likelihood = -172.62267  (not concave)
Iteration 1:  Log likelihood = -164.82639  
Iteration 2:  Log likelihood = -164.66343  
Iteration 3:  Log likelihood = -164.65716  
Iteration 4:  Log likelihood = -164.65715  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =      9
        Upper = 100                                    Right-censored =     13

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =   8.00
Log likelihood = -164.65715                         Prob > chi2       = 0.1563

--------------------------------------------------------------------------------------
   prop_emne_capital | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
      gni_per_capita |  -.0118473   .0191621    -0.62   0.536    -.0494042    .0257097
broadband_per_capita |   11.01539   22.22122     0.50   0.620     -32.5374    54.56817
  mobiles_per_capita |   .0463749   .3164644     0.15   0.883    -.5738839    .6666337
geographic_proximity |   10.29442    22.4168     0.46   0.646     -33.6417    54.23053
       colonial_link |  -60.73708   21.97825    -2.76   0.006    -103.8137    -17.6605
               _cons |   84.37497   28.82498     2.93   0.003     27.87904    140.8709
---------------------+----------------------------------------------------------------
            /sigma_u |   6.25e-14   45.90741     0.00   1.000    -89.97687    89.97687
            /sigma_e |   64.00777   9.996202     6.40   0.000     44.41558    83.59997
---------------------+----------------------------------------------------------------
                 rho |   9.52e-31   1.40e-15                             0           1
--------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_5a_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_5a_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:25:55
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:25:55

. tobit prop_emne_capital gni_per_capita broadband_per_capita mobiles_per_capita geographic_pro
> ximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -172.62267

Fitting full model:

Iteration 0:  Log likelihood = -172.62267  
Iteration 1:  Log likelihood = -165.28078  
Iteration 2:  Log likelihood = -164.67364  
Iteration 3:  Log likelihood = -164.65717  
Iteration 4:  Log likelihood = -164.65715  
Iteration 5:  Log likelihood = -164.65715  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =      9
        Upper = 100                                    Right-censored =     13

                                                    LR chi2(5)        =   8.04
                                                    Prob > chi2       = 0.1539
Log likelihood = -164.65715                         Pseudo R2         = 0.0238

------------------------------------------------------------------------------------------
       prop_emne_capital | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
          gni_per_capita |  -.0118472   .0191621    -0.62   0.540    -.0504913    .0267968
    broadband_per_capita |   11.01539   22.22124     0.50   0.623      -33.798    55.82878
      mobiles_per_capita |   .0463752   .3164647     0.15   0.884    -.5918367     .684587
    geographic_proximity |   10.29442   22.41682     0.46   0.648    -34.91339    55.50224
           colonial_link |   -60.7371   21.97827    -2.76   0.008    -105.0605   -16.41369
                   _cons |   84.37495   28.82501     2.93   0.005     26.24379    142.5061
-------------------------+----------------------------------------------------------------
 var(e.prop_emne_capital)|   4097.002   1279.673                      2182.245    7691.814
------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:25:56
-----------------------------------------------------------------------------------------------
