-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:26:01

. xttobit prop_emne_capital voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_
> law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita geographic_p
> roximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -175.95295  
Iteration 1:  Log likelihood =  -169.2299  
Iteration 2:  Log likelihood = -168.67822  
Iteration 3:  Log likelihood = -168.67822  

Fitting full model:

Iteration 0:  Log likelihood = -164.71426  
Iteration 1:  Log likelihood = -159.76854  
Iteration 2:  Log likelihood = -159.65702  
Iteration 3:  Log likelihood = -159.65685  
Iteration 4:  Log likelihood = -159.65685  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -239.54583
Iteration 1:  Log likelihood = -238.95994
Iteration 2:  Log likelihood = -238.64992
Iteration 3:  Log likelihood = -238.64147
Iteration 4:  Log likelihood = -238.64146

Fitting full model:

Iteration 0:  Log likelihood = -168.36604  (not concave)
Iteration 1:  Log likelihood = -161.18377  
Iteration 2:  Log likelihood = -160.01826  
Iteration 3:  Log likelihood = -159.65936  
Iteration 4:  Log likelihood = -159.65685  
Iteration 5:  Log likelihood = -159.65685  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =      9
        Upper = 100                                    Right-censored =     13

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  17.21
Log likelihood = -159.65685                         Prob > chi2       = 0.1018

---------------------------------------------------------------------------------------
    prop_emne_capital | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
        voice_and_acc |    14.7395   19.64367     0.75   0.453    -23.76139     53.2404
        pol_stability |   42.52351   22.67874     1.88   0.061    -1.925998    86.97303
   govt_effectiveness |  -57.50236   48.41315    -1.19   0.235    -152.3904    37.38568
          reg_quality |  -47.13143   70.60542    -0.67   0.504    -185.5155    91.25265
          rule_of_law |  -52.68141   50.76021    -1.04   0.299    -152.1696    46.80678
control_of_corruption |   67.17387     41.521     1.62   0.106     -14.2058    148.5535
       gni_per_capita |   -.027212   .0209264    -1.30   0.193    -.0682271    .0138031
 broadband_per_capita |   20.59484   20.85175     0.99   0.323    -20.27383    61.46352
   mobiles_per_capita |  -.0918664   .3766847    -0.24   0.807    -.8301549     .646422
 geographic_proximity |    21.6179   21.68588     1.00   0.319    -20.88565    64.12145
        colonial_link |  -65.27721   23.34885    -2.80   0.005    -111.0401    -19.5143
                _cons |   60.69658   55.42645     1.10   0.273    -47.93726    169.3304
----------------------+----------------------------------------------------------------
             /sigma_u |   1.32e-15   16.96791     0.00   1.000    -33.25649    33.25649
             /sigma_e |   56.92226   8.822535     6.45   0.000     39.63041    74.21411
----------------------+----------------------------------------------------------------
                  rho |   5.34e-34   1.38e-17                             0           1
---------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_5b_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_5b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:26:01
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:26:01

. tobit prop_emne_capital voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_la
> w control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita geographic_pro
> ximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -168.36604

Fitting full model:

Iteration 0:  Log likelihood = -168.36604  
Iteration 1:  Log likelihood = -160.60497  
Iteration 2:  Log likelihood = -159.70769  
Iteration 3:  Log likelihood = -159.65694  
Iteration 4:  Log likelihood = -159.65685  
Iteration 5:  Log likelihood = -159.65685  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower =   0                                     Left-censored =      9
        Upper = 100                                    Right-censored =     13

                                                    LR chi2(11)       =  18.04
                                                    Prob > chi2       = 0.0806
Log likelihood = -159.65685                         Pseudo R2         = 0.0535

------------------------------------------------------------------------------------------
       prop_emne_capital | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
           voice_and_acc |    14.7395   19.64367     0.75   0.458    -25.06236    54.54137
           pol_stability |   42.52351   22.67874     1.88   0.069    -3.427979    88.47501
      govt_effectiveness |  -57.50236   48.41316    -1.19   0.243    -155.5967    40.59201
             reg_quality |  -47.13143   70.60543    -0.67   0.509    -190.1916    95.92875
             rule_of_law |  -52.68141   50.76022    -1.04   0.306    -155.5314    50.16856
   control_of_corruption |   67.17387   41.52101     1.62   0.114    -16.95568    151.3034
          gni_per_capita |   -.027212   .0209264    -1.30   0.202     -.069613     .015189
    broadband_per_capita |   20.59484   20.85175     0.99   0.330    -21.65481     62.8445
      mobiles_per_capita |  -.0918664   .3766847    -0.24   0.809    -.8551022    .6713693
    geographic_proximity |    21.6179   21.68588     1.00   0.325    -22.32188    65.55767
           colonial_link |  -65.27721   23.34885    -2.80   0.008    -112.5865   -17.96793
                   _cons |   60.69658   55.42645     1.10   0.281    -51.60808    173.0012
-------------------------+----------------------------------------------------------------
 var(e.prop_emne_capital)|   3240.144   1004.397                      1728.973    6072.121
------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_5b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:26:01
-----------------------------------------------------------------------------------------------
