-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_4b_replication.log
  log type:  text
 opened on:  19 Dec 2024, 13:02:22

. xttobit prop_emne_excl_qst_source voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_ca
> pita geographic_proximity colonial_link, ll(0) ul(1) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood =  -36.97795  
Iteration 1:  Log likelihood = -34.068505  
Iteration 2:  Log likelihood = -34.002949  
Iteration 3:  Log likelihood = -34.002899  
Iteration 4:  Log likelihood = -34.002899  

Fitting full model:

Iteration 0:  Log likelihood = -22.391219  
Iteration 1:  Log likelihood = -20.257291  
Iteration 2:  Log likelihood = -20.249409  
Iteration 3:  Log likelihood = -20.249408  

Obtaining starting values for full model:

Iteration 0:  Log likelihood =   1.894375
Iteration 1:  Log likelihood =  2.4952781
Iteration 2:  Log likelihood =  2.7496296
Iteration 3:  Log likelihood =  2.7552923
Iteration 4:  Log likelihood =  2.7552961

Fitting full model:

Iteration 0:  Log likelihood = -24.420464  (not concave)
Iteration 1:  Log likelihood = -21.222943  
Iteration 2:  Log likelihood = -20.278464  
Iteration 3:  Log likelihood = -20.249468  
Iteration 4:  Log likelihood = -20.249408  
Iteration 5:  Log likelihood = -20.249408  

Random-effects tobit regression                     Number of obs     =     50
                                                           Uncensored =     36
Limits: Lower = 0                                       Left-censored =      5
        Upper = 1                                      Right-censored =      9

Group variable: country_id                          Number of groups  =     25
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  28.45
Log likelihood = -20.249408                         Prob > chi2       = 0.0028

-------------------------------------------------------------------------------------------
prop_emne_excl_qst_source | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
            voice_and_acc |   .0146677   .1059898     0.14   0.890    -.1930684    .2224038
            pol_stability |   .3168918   .1159364     2.73   0.006     .0896606    .5441231
       govt_effectiveness |  -.2094161    .223627    -0.94   0.349    -.6477169    .2288847
              reg_quality |  -.0667615   .3465923    -0.19   0.847    -.7460699    .6125469
              rule_of_law |  -.4928551   .2487157    -1.98   0.048    -.9803289   -.0053814
    control_of_corruption |   .3535734   .2075643     1.70   0.088    -.0532453     .760392
           gni_per_capita |  -.0001847   .0001072    -1.72   0.085    -.0003947    .0000254
     broadband_per_capita |   .2266425   .1153152     1.97   0.049     .0006289    .4526561
       mobiles_per_capita |   -.003868   .0019814    -1.95   0.051    -.0077515    .0000155
     geographic_proximity |   .0087828   .1013284     0.09   0.931    -.1898171    .2073828
            colonial_link |  -.4639948   .1285156    -3.61   0.000    -.7158807   -.2121089
                    _cons |   1.001402   .3301454     3.03   0.002     .3543288    1.648475
--------------------------+----------------------------------------------------------------
                 /sigma_u |   2.13e-18   .0875749     0.00   1.000    -.1716437    .1716437
                 /sigma_e |   .3009825   .0382856     7.86   0.000     .2259441    .3760209
--------------------------+----------------------------------------------------------------
                      rho |   5.01e-35   4.12e-18                             0           1
-------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_4b_replication.log
  log type:  text
 closed on:  19 Dec 2024, 13:02:22
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_4b_replication.log
  log type:  text
 opened on:  19 Dec 2024, 13:02:22

. tobit prop_emne_excl_qst_source voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capi
> ta geographic_proximity colonial_link, ll(0) ul(1)

Refining starting values:

Grid node 0:  Log likelihood = -24.420464

Fitting full model:

Iteration 0:  Log likelihood = -24.420464  
Iteration 1:  Log likelihood = -20.496392  
Iteration 2:  Log likelihood =  -20.25292  
Iteration 3:  Log likelihood = -20.249409  
Iteration 4:  Log likelihood = -20.249408  

Tobit regression                                    Number of obs     =     50
                                                           Uncensored =     36
Limits: Lower = 0                                       Left-censored =      5
        Upper = 1                                      Right-censored =      9

                                                    LR chi2(11)       =  27.51
                                                    Prob > chi2       = 0.0038
Log likelihood = -20.249408                         Pseudo R2         = 0.4045

--------------------------------------------------------------------------------------------------
       prop_emne_excl_qst_source | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------------+----------------------------------------------------------------
                   voice_and_acc |   .0146677   .1059898     0.14   0.891    -.1997168    .2290522
                   pol_stability |   .3168918   .1159364     2.73   0.009     .0823882    .5513954
              govt_effectiveness |  -.2094161   .2236269    -0.94   0.355    -.6617443    .2429121
                     reg_quality |  -.0667615   .3465923    -0.19   0.848    -.7678106    .6342875
                     rule_of_law |  -.4928551   .2487157    -1.98   0.055      -.99593    .0102198
           control_of_corruption |   .3535733   .2075643     1.70   0.096    -.0662652    .7734118
                  gni_per_capita |  -.0001847   .0001072    -1.72   0.093    -.0004015    .0000321
            broadband_per_capita |   .2266425   .1153152     1.97   0.057    -.0066044    .4598894
              mobiles_per_capita |   -.003868   .0019814    -1.95   0.058    -.0078758    .0001398
            geographic_proximity |   .0087828   .1013284     0.09   0.931    -.1961731    .2137388
                   colonial_link |  -.4639948   .1285156    -3.61   0.001     -.723942   -.2040475
                           _cons |   1.001402   .3301454     3.03   0.004     .3336198    1.669184
---------------------------------+----------------------------------------------------------------
 var(e.prop_emne_excl_qst_source)|   .0905905   .0230466                      .0541506    .1515521
--------------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_4b_replication.log
  log type:  text
 closed on:  19 Dec 2024, 13:02:22
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_4b_replication.log
  log type:  text
 opened on:  19 Dec 2024, 13:02:22

. summarize prop_emne_excl_qst_source voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_
> capita geographic_proximity colonial_link

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
prop_emne_~e |         50    .5478295    .2988644          0          1
voice_and_~c |         50   -.6506996     .599852  -1.575842   .4083861
pol_stabil~y |         50   -.7763648    .6931311  -2.339439   .2061908
govt_effec~s |         50   -.9963213    .4569956  -2.170481   .1787704
 reg_quality |         50   -.7691492    .3514532  -1.500688   .0843835
-------------+---------------------------------------------------------
 rule_of_law |         50   -.8506458    .4592438  -1.850578   .1168476
control_of~n |         50   -.7706786    .5027427  -1.511605   .6184556
gni_per_ca~a |         50    1008.908    630.6912   278.1263   2862.964
broadband_~a |         50    .3647574    .5393082   .0011483    2.33941
mobiles_pe~a |         50    73.54248    33.06652   23.52311   128.0767
-------------+---------------------------------------------------------
geographic~y |         50         .38    .4903144          0          1
colonial_l~k |         50         .42    .4985694          0          1

. pwcorr prop_emne_excl_qst_source voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_cap
> ita geographic_proximity colonial_link, star(0.05)

             | prop_~ce voice_~c pol_st~y govt_e~s reg_qu~y rule_o~w contro~n
-------------+---------------------------------------------------------------
prop_emne_~e |   1.0000 
voice_and_~c |  -0.3005*  1.0000 
pol_stabil~y |  -0.1733   0.4718*  1.0000 
govt_effec~s |  -0.3566*  0.3340*  0.5161*  1.0000 
 reg_quality |  -0.3793*  0.4481*  0.6185*  0.8621*  1.0000 
 rule_of_law |  -0.3616*  0.4574*  0.5443*  0.7974*  0.8183*  1.0000 
control_of~n |  -0.2796*  0.4777*  0.4098*  0.7721*  0.7882*  0.8597*  1.0000 
gni_per_ca~a |   0.0418   0.0316   0.4500*  0.0766   0.0427   0.0837  -0.0218 
broadband_~a |   0.0973  -0.0423   0.2441   0.1706   0.1945   0.1674   0.1198 
mobiles_pe~a |  -0.2330   0.4922*  0.5054*  0.3968*  0.5120*  0.3780*  0.3524*
geographic~y |   0.0550  -0.0164  -0.0158   0.1692   0.0892   0.0986   0.1330 
colonial_l~k |  -0.4264*  0.3974*  0.3972*  0.3229*  0.4493*  0.2791*  0.2918*

             | gni_pe~a broadb~a mobile~a geogra~y coloni~k
-------------+---------------------------------------------
gni_per_ca~a |   1.0000 
broadband_~a |   0.5075*  1.0000 
mobiles_pe~a |   0.1053   0.0731   1.0000 
geographic~y |  -0.0732   0.2504   0.1079   1.0000 
colonial_l~k |  -0.1058   0.1252   0.0858   0.0017   1.0000 

. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_4b_replication.log
  log type:  text
 closed on:  19 Dec 2024, 13:02:22
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
