-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_6b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:26:30

. xttobit prop_emne_capital_excl_nat_res voice_and_acc pol_stability govt_effectiveness reg_qua
> lity rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita
>  geographic_proximity colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -172.79175  
Iteration 1:  Log likelihood = -165.45036  
Iteration 2:  Log likelihood = -164.71805  
Iteration 3:  Log likelihood = -164.71748  
Iteration 4:  Log likelihood = -164.71748  

Fitting full model:

Iteration 0:  Log likelihood = -160.66443  
Iteration 1:  Log likelihood = -155.17442  
Iteration 2:  Log likelihood = -155.02654  
Iteration 3:  Log likelihood = -155.02619  
Iteration 4:  Log likelihood = -155.02619  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -238.76496
Iteration 1:  Log likelihood = -238.17907
Iteration 2:  Log likelihood = -237.86904
Iteration 3:  Log likelihood =  -237.8606
Iteration 4:  Log likelihood = -237.86059

Fitting full model:

Iteration 0:  Log likelihood = -164.49649  (not concave)
Iteration 1:  Log likelihood = -156.17515  
Iteration 2:  Log likelihood = -155.10405  
Iteration 3:  Log likelihood = -155.02622  
Iteration 4:  Log likelihood = -155.02619  
Iteration 5:  Log likelihood = -155.02619  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     25
Limits: Lower =   0                                     Left-censored =     10
        Upper = 100                                    Right-censored =     13

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  18.13
Log likelihood = -155.02619                         Prob > chi2       = 0.0786

----------------------------------------------------------------------------------------------
prop_emne_capital_excl_nat~s | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
               voice_and_acc |   18.96997   20.09533     0.94   0.345    -20.41616     58.3561
               pol_stability |   44.87988   23.26773     1.93   0.054    -.7240338     90.4838
          govt_effectiveness |  -50.21995   49.26017    -1.02   0.308    -146.7681     46.3282
                 reg_quality |  -56.74407   72.30285    -0.78   0.433     -198.455     84.9669
                 rule_of_law |  -43.81991   51.26668    -0.85   0.393    -144.3008    56.66095
       control_of_corruption |   58.52037   42.08204     1.39   0.164    -23.95891    140.9996
              gni_per_capita |  -.0327199    .021598    -1.51   0.130    -.0750512    .0096115
        broadband_per_capita |   13.77274   21.45643     0.64   0.521    -28.28109    55.82656
          mobiles_per_capita |  -.0676986   .3818742    -0.18   0.859    -.8161582     .680761
        geographic_proximity |   22.46772   22.04694     1.02   0.308    -20.74349    65.67893
               colonial_link |  -71.43047   24.02642    -2.97   0.003    -118.5214   -24.33955
                       _cons |   72.03584   56.52077     1.27   0.202    -38.74283    182.8145
-----------------------------+----------------------------------------------------------------
                    /sigma_u |   1.45e-15   16.27731     0.00   1.000    -31.90293    31.90293
                    /sigma_e |   57.68174   9.156453     6.30   0.000     39.73542    75.62805
-----------------------------+----------------------------------------------------------------
                         rho |   6.31e-34   1.42e-17                             0           1
----------------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_6b_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_6b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_6b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:26:31
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_6b_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:26:31

. tobit prop_emne_capital_excl_nat_res voice_and_acc pol_stability govt_effectiveness reg_quali
> ty rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobiles_per_capita g
> eographic_proximity colonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -164.49649

Fitting full model:

Iteration 0:  Log likelihood = -164.49649  
Iteration 1:  Log likelihood = -156.15413  
Iteration 2:  Log likelihood = -155.09292  
Iteration 3:  Log likelihood = -155.02648  
Iteration 4:  Log likelihood = -155.02619  
Iteration 5:  Log likelihood = -155.02619  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     25
Limits: Lower =   0                                     Left-censored =     10
        Upper = 100                                    Right-censored =     13

                                                    LR chi2(11)       =  19.38
                                                    Prob > chi2       = 0.0546
Log likelihood = -155.02619                         Pseudo R2         = 0.0588

----------------------------------------------------------------------------------------------
prop_emne_capital_excl_nat~s | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
               voice_and_acc |   18.96997   20.09533     0.94   0.351    -21.74704    59.68698
               pol_stability |   44.87988   23.26773     1.93   0.061     -2.26502    92.02478
          govt_effectiveness |  -50.21995   49.26017    -1.02   0.315    -150.0305    49.59063
                 reg_quality |  -56.74407   72.30285    -0.78   0.438    -203.2436    89.75541
                 rule_of_law |  -43.81991   51.26668    -0.85   0.398    -147.6961    60.05626
       control_of_corruption |   58.52037   42.08204     1.39   0.173    -26.74594    143.7867
              gni_per_capita |  -.0327199    .021598    -1.51   0.138    -.0764816    .0110419
        broadband_per_capita |   13.77274   21.45643     0.64   0.525    -29.70211    57.24758
          mobiles_per_capita |  -.0676986   .3818742    -0.18   0.860    -.8414491    .7060519
        geographic_proximity |   22.46772   22.04694     1.02   0.315    -22.20363    67.13906
               colonial_link |  -71.43047   24.02642    -2.97   0.005    -120.1126   -22.74832
                       _cons |   72.03584   56.52077     1.27   0.210    -42.48612    186.5578
-----------------------------+----------------------------------------------------------------
var(e.prop_emne_capital_ex~s)|   3327.183    1056.32                      1748.654    6330.665
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_6b_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:26:31
-----------------------------------------------------------------------------------------------
