----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3a_replication.log
  log type:  text
 opened on:  20 Dec 2024, 23:48:06

. xttobit prop_emne_capital gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity, ll(0) ul(1) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -56.218521  
Iteration 1:  Log likelihood = -49.495476  
Iteration 2:  Log likelihood = -48.943797  
Iteration 3:  Log likelihood = -48.943794  

Fitting full model:

Iteration 0:  Log likelihood = -54.766269  
Iteration 1:  Log likelihood = -49.208136  
Iteration 2:  Log likelihood = -48.811658  
Iteration 3:  Log likelihood = -48.811531  
Iteration 4:  Log likelihood = -48.811531  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -26.266476
Iteration 1:  Log likelihood = -26.130121
Iteration 2:  Log likelihood = -26.126456
Iteration 3:  Log likelihood = -26.126454

Fitting full model:

Iteration 0:  Log likelihood = -56.517271  (not concave)
Iteration 1:  Log likelihood = -49.128544  
Iteration 2:  Log likelihood = -48.812953  
Iteration 3:  Log likelihood = -48.811532  
Iteration 4:  Log likelihood = -48.811531  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower = 0                                       Left-censored =      9
        Upper = 1                                      Right-censored =     13

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(4)      =   0.27
Log likelihood = -48.811531                         Prob > chi2       = 0.9918

--------------------------------------------------------------------------------------
   prop_emne_capital | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
      gni_per_capita |  -.0000749   .0002087    -0.36   0.720     -.000484    .0003342
broadband_per_capita |  -.0088575   .2363502    -0.04   0.970    -.4720954    .4543804
  mobiles_per_capita |  -.0000474   .0034214    -0.01   0.989    -.0067533    .0066585
geographic_proximity |   .0471265   .2423092     0.19   0.846    -.4277907    .5220438
               _cons |   .6941708    .306918     2.26   0.024     .0926226    1.295719
---------------------+----------------------------------------------------------------
            /sigma_u |   2.61e-17    .298144     0.00   1.000    -.5843515    .5843515
            /sigma_e |    .701781    .110514     6.35   0.000     .4851776    .9183844
---------------------+----------------------------------------------------------------
                 rho |   1.38e-33   3.16e-17                             0           1
--------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)

. esttab re_model using "../results/model_3a_results.csv", replace title("Random Effects Panel Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_3a_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3a_replication.log
  log type:  text
 closed on:  20 Dec 2024, 23:48:07
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3a_replication.log
  log type:  text
 opened on:  20 Dec 2024, 23:48:07

. tobit prop_emne_capital gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity, ll(0) ul(1)

Refining starting values:

Grid node 0:  Log likelihood = -56.517271

Fitting full model:

Iteration 0:  Log likelihood = -56.517271  
Iteration 1:  Log likelihood = -48.956625  
Iteration 2:  Log likelihood =  -48.81387  
Iteration 3:  Log likelihood = -48.811534  
Iteration 4:  Log likelihood = -48.811531  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     26
Limits: Lower = 0                                       Left-censored =      9
        Upper = 1                                      Right-censored =     13

                                                    LR chi2(4)        =   0.26
                                                    Prob > chi2       = 0.9920
Log likelihood = -48.811531                         Pseudo R2         = 0.0027

------------------------------------------------------------------------------------------
       prop_emne_capital | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------+----------------------------------------------------------------
          gni_per_capita |  -.0000749   .0002087    -0.36   0.721    -.0004955    .0003457
    broadband_per_capita |  -.0088575   .2363501    -0.04   0.970    -.4851898    .4674748
      mobiles_per_capita |  -.0000474   .0034214    -0.01   0.989    -.0069428    .0068481
    geographic_proximity |   .0471265   .2423091     0.19   0.847    -.4412153    .5354684
                   _cons |   .6941708   .3069179     2.26   0.029     .0756185    1.312723
-------------------------+----------------------------------------------------------------
 var(e.prop_emne_capital)|   .4924961   .1551129                      .2610577    .9291144
------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_3a_replication.log
  log type:  text
 closed on:  20 Dec 2024, 23:48:07
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
