----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2b_replication.log
  log type:  text
 opened on:  19 Dec 2024, 21:44:36

. xttobit prop_emne_excl_nat_res voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobi
> les_per_capita geographic_proximity colonial_link, ll(0) ul(1) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -41.682702  
Iteration 1:  Log likelihood = -37.753356  
Iteration 2:  Log likelihood = -37.612174  
Iteration 3:  Log likelihood =  -37.61188  
Iteration 4:  Log likelihood =  -37.61188  

Fitting full model:

Iteration 0:  Log likelihood = -29.079291  
Iteration 1:  Log likelihood = -26.474818  
Iteration 2:  Log likelihood = -26.458771  
Iteration 3:  Log likelihood = -26.458769  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -2.6831077
Iteration 1:  Log likelihood = -2.0972172
Iteration 2:  Log likelihood = -1.7871915
Iteration 3:  Log likelihood = -1.7787465
Iteration 4:  Log likelihood = -1.7787379

Fitting full model:

Iteration 0:  Log likelihood =  -31.66742  
Iteration 1:  Log likelihood = -26.523151  
Iteration 2:  Log likelihood = -26.458775  
Iteration 3:  Log likelihood = -26.458769  
Iteration 4:  Log likelihood = -26.458769  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     32
Limits: Lower = 0                                       Left-censored =      6
        Upper = 1                                      Right-censored =     10

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(11)     =  22.66
Log likelihood = -26.458769                         Prob > chi2       = 0.0197

----------------------------------------------------------------------------------------
prop_emne_excl_nat_res | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------------+----------------------------------------------------------------
         voice_and_acc |  -.0013173   .1260638    -0.01   0.992    -.2483977    .2457631
         pol_stability |   .2754826   .1381369     1.99   0.046     .0047393    .5462258
    govt_effectiveness |  -.4094593   .2761147    -1.48   0.138    -.9506341    .1317155
           reg_quality |  -.1182915   .4171536    -0.28   0.777    -.9358974    .6993145
           rule_of_law |  -.3797436   .2976047    -1.28   0.202    -.9630382     .203551
 control_of_corruption |   .4112079   .2464566     1.67   0.095    -.0718383     .894254
        gni_per_capita |   -.000158   .0001293    -1.22   0.222    -.0004114    .0000954
  broadband_per_capita |   .1831514   .1335818     1.37   0.170    -.0786643     .444967
    mobiles_per_capita |  -.0016114   .0023722    -0.68   0.497    -.0062608     .003038
  geographic_proximity |   .0869775   .1214987     0.72   0.474    -.1511556    .3251107
         colonial_link |  -.4443313   .1506345    -2.95   0.003    -.7395694   -.1490931
                 _cons |   .6650114   .3911027     1.70   0.089    -.1015358    1.431559
-----------------------+----------------------------------------------------------------
              /sigma_u |   1.40e-17   .0874287     0.00   1.000    -.1713571    .1713571
              /sigma_e |   .3534529    .048501     7.29   0.000     .2583927    .4485131
-----------------------+----------------------------------------------------------------
                   rho |   1.56e-33   1.96e-17                             0           1
----------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model

. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)

. esttab re_model using "../results/model_2b_results.csv", replace title("Random Effects Panel Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(file ../results/model_2b_results.csv not found)
(output written to ../results/model_2b_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2b_replication.log
  log type:  text
 closed on:  19 Dec 2024, 21:44:36
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2b_replication.log
  log type:  text
 opened on:  19 Dec 2024, 21:44:36

. tobit prop_emne_excl_nat_res voice_and_acc pol_stability govt_effectiveness reg_quality rule_of_law control_of_corruption gni_per_capita broadband_per_capita mobile
> s_per_capita geographic_proximity colonial_link, ll(0) ul(1)

Refining starting values:

Grid node 0:  Log likelihood =  -31.66742

Fitting full model:

Iteration 0:  Log likelihood =  -31.66742  
Iteration 1:  Log likelihood = -26.887465  
Iteration 2:  Log likelihood = -26.462672  
Iteration 3:  Log likelihood = -26.458776  
Iteration 4:  Log likelihood = -26.458769  
Iteration 5:  Log likelihood = -26.458769  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     32
Limits: Lower = 0                                       Left-censored =      6
        Upper = 1                                      Right-censored =     10

                                                    LR chi2(11)       =  22.31
                                                    Prob > chi2       = 0.0221
Log likelihood = -26.458769                         Pseudo R2         = 0.2965

-----------------------------------------------------------------------------------------------
       prop_emne_excl_nat_res | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
                voice_and_acc |  -.0013173   .1260638    -0.01   0.992    -.2567467    .2541122
                pol_stability |   .2754826   .1381369     1.99   0.054    -.0044093    .5553744
           govt_effectiveness |  -.4094593   .2761147    -1.48   0.147    -.9689207    .1500022
                  reg_quality |  -.1182915   .4171536    -0.28   0.778    -.9635249     .726942
                  rule_of_law |  -.3797436   .2976047    -1.28   0.210    -.9827481    .2232609
        control_of_corruption |   .4112079   .2464566     1.67   0.104    -.0881607    .9105764
               gni_per_capita |   -.000158   .0001293    -1.22   0.229    -.0004199     .000104
         broadband_per_capita |   .1831514   .1335818     1.37   0.179    -.0875112    .4538139
           mobiles_per_capita |  -.0016114   .0023722    -0.68   0.501    -.0064179    .0031951
         geographic_proximity |   .0869775   .1214987     0.72   0.479    -.1592023    .3331573
                colonial_link |  -.4443313   .1506345    -2.95   0.005    -.7495457   -.1391169
                        _cons |   .6650114   .3911027     1.70   0.097    -.1274379    1.457461
------------------------------+----------------------------------------------------------------
 var(e.prop_emne_excl_nat_res)|    .124929   .0342856                      .0716415    .2178519
-----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison

. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../results/model_2b_replication.log
  log type:  text
 closed on:  19 Dec 2024, 21:44:37
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
