-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 opened on:  26 Dec 2024, 12:42:43

. xttobit prop_emne_excl_col_link gni_per_capita broadband_per_capita mobiles_per_capita geogra
> phic_proximity, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -189.60749  
Iteration 1:  Log likelihood = -186.08008  
Iteration 2:  Log likelihood = -185.97993  
Iteration 3:  Log likelihood =  -185.9798  
Iteration 4:  Log likelihood =  -185.9798  

Fitting full model:

Iteration 0:  Log likelihood = -185.88151  
Iteration 1:  Log likelihood = -182.82184  
Iteration 2:  Log likelihood =  -182.7713  
Iteration 3:  Log likelihood = -182.77128  
Iteration 4:  Log likelihood = -182.77128  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -228.24069
Iteration 1:  Log likelihood = -228.10433
Iteration 2:  Log likelihood = -228.10067
Iteration 3:  Log likelihood = -228.10067

Fitting full model:

Iteration 0:  Log likelihood = -187.06261  (not concave)
Iteration 1:  Log likelihood = -183.38103  (not concave)
Iteration 2:  Log likelihood =  -183.0109  (not concave)
Iteration 3:  Log likelihood =  -182.9248  (not concave)
Iteration 4:  Log likelihood = -182.83501  (not concave)
Iteration 5:  Log likelihood = -182.81632  (not concave)
Iteration 6:  Log likelihood = -182.80285  (not concave)
Iteration 7:  Log likelihood = -182.80268  (not concave)
Iteration 8:  Log likelihood = -182.79265  (not concave)
Iteration 9:  Log likelihood = -182.77485  (not concave)
Iteration 10: Log likelihood = -182.77269  (not concave)
Iteration 11: Log likelihood = -182.77228  (not concave)
Iteration 12: Log likelihood = -182.77121  (not concave)
Iteration 13: Log likelihood = -182.76261  
Iteration 14: Log likelihood = -182.75648  
Iteration 15: Log likelihood = -182.75643  
Iteration 16: Log likelihood = -182.75643  

Random-effects tobit regression                     Number of obs     =     48
                                                           Uncensored =     33
Limits: Lower =   0                                     Left-censored =      4
        Upper = 100                                    Right-censored =     11

Group variable: country_id                          Number of groups  =     24
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(4)      =   5.79
Log likelihood = -182.75643                         Prob > chi2       = 0.2155

-----------------------------------------------------------------------------------------
prop_emne_excl_col_link | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------+----------------------------------------------------------------
         gni_per_capita |   .0007607   .0117553     0.06   0.948    -.0222794    .0238007
   broadband_per_capita |   18.69713   14.93009     1.25   0.210    -10.56531    47.95958
     mobiles_per_capita |   -.409416   .1969763    -2.08   0.038    -.7954825   -.0233496
   geographic_proximity |     6.1773   12.94561     0.48   0.633    -19.19564    31.55024
                  _cons |   83.33162   18.01803     4.62   0.000     48.01694    118.6463
------------------------+----------------------------------------------------------------
               /sigma_u |   7.717579   22.47135     0.34   0.731    -36.32545    51.76061
               /sigma_e |   38.11193   6.696184     5.69   0.000     24.98765    51.23621
------------------------+----------------------------------------------------------------
                    rho |   .0393901   .2285927                      1.09e-12    .9997732
-----------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.03               Prob >= chibar2 = 0.432


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_3a_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_3a_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 closed on:  26 Dec 2024, 12:42:43
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 opened on:  26 Dec 2024, 12:42:43

. tobit prop_emne_excl_col_link gni_per_capita broadband_per_capita mobiles_per_capita geograph
> ic_proximity, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -187.06261

Fitting full model:

Iteration 0:  Log likelihood = -187.06261  
Iteration 1:  Log likelihood = -183.03407  
Iteration 2:  Log likelihood = -182.77562  
Iteration 3:  Log likelihood = -182.77128  
Iteration 4:  Log likelihood = -182.77128  

Tobit regression                                    Number of obs     =     48
                                                           Uncensored =     33
Limits: Lower =   0                                     Left-censored =      4
        Upper = 100                                    Right-censored =     11

                                                    LR chi2(4)        =   6.42
                                                    Prob > chi2       = 0.1701
Log likelihood = -182.77128                         Pseudo R2         = 0.0173

----------------------------------------------------------------------------------------------
     prop_emne_excl_col_link | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------+----------------------------------------------------------------
              gni_per_capita |   .0005198    .011463     0.05   0.964    -.0225824    .0236219
        broadband_per_capita |   19.09994   14.56878     1.31   0.197    -10.26152    48.46139
          mobiles_per_capita |  -.4084324   .1935669    -2.11   0.041     -.798541   -.0183239
        geographic_proximity |   5.828688   12.70037     0.46   0.649    -19.76722     31.4246
                       _cons |   83.43397   17.69259     4.72   0.000      47.7769     119.091
-----------------------------+----------------------------------------------------------------
var(e.prop_emne_excl_col_l~k)|   1510.697    408.871                      875.5624    2606.561
----------------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_3a_replication.log
  log type:  text
 closed on:  26 Dec 2024, 12:42:44
-----------------------------------------------------------------------------------------------
