-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:24:05

. xttobit prop_emne gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity
>  colonial_link, ll(0) ul(100) re

Fitting comparison model:

Fitting constant-only model:

Iteration 0:  Log likelihood = -203.25602  
Iteration 1:  Log likelihood = -200.36357  
Iteration 2:  Log likelihood =  -200.2989  
Iteration 3:  Log likelihood = -200.29885  
Iteration 4:  Log likelihood = -200.29885  

Fitting full model:

Iteration 0:  Log likelihood = -195.23047  
Iteration 1:  Log likelihood =  -192.8869  
Iteration 2:  Log likelihood = -192.86588  
Iteration 3:  Log likelihood = -192.86588  

Obtaining starting values for full model:

Iteration 0:  Log likelihood = -234.37418
Iteration 1:  Log likelihood = -234.18569
Iteration 2:  Log likelihood = -234.17836
Iteration 3:  Log likelihood = -234.17835

Fitting full model:

Iteration 0:  Log likelihood = -196.45797  (not concave)
Iteration 1:  Log likelihood = -193.16352  
Iteration 2:  Log likelihood =  -192.8689  
Iteration 3:  Log likelihood = -192.86588  
Iteration 4:  Log likelihood = -192.86588  

Random-effects tobit regression                     Number of obs     =     50
                                                           Uncensored =     36
Limits: Lower =   0                                     Left-censored =      5
        Upper = 100                                    Right-censored =      9

Group variable: country_id                          Number of groups  =     25
Random effects u_i ~ Gaussian                       Obs per group:
                                                                  min =      2
                                                                  avg =    2.0
                                                                  max =      2

Integration method: mvaghermite                     Integration pts.  =     12

                                                    Wald chi2(5)      =  15.32
Log likelihood = -192.86588                         Prob > chi2       = 0.0091

--------------------------------------------------------------------------------------
           prop_emne | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------------+----------------------------------------------------------------
      gni_per_capita |  -.0048842   .0099579    -0.49   0.624    -.0244014     .014633
broadband_per_capita |   16.27357   12.40098     1.31   0.189    -8.031896    40.57903
  mobiles_per_capita |  -.2645606   .1611939    -1.64   0.101    -.5804948    .0513737
geographic_proximity |   .8601427   11.25695     0.08   0.939    -21.20307    22.92336
       colonial_link |  -37.10611   10.83472    -3.42   0.001    -58.34178   -15.87045
               _cons |   89.79618   16.28684     5.51   0.000     57.87455    121.7178
---------------------+----------------------------------------------------------------
            /sigma_u |   1.09e-13    34.7756     0.00   1.000    -68.15892    68.15892
            /sigma_e |   34.75926   4.446461     7.82   0.000     26.04436    43.47416
---------------------+----------------------------------------------------------------
                 rho |   9.79e-30   6.26e-15                             0           1
--------------------------------------------------------------------------------------
LR test of sigma_u=0: chibar2(01) = 0.00               Prob >= chibar2 = 1.000


. 
. * Store the results of the random effects model
. estimates store re_model

. 
. * Export Tobit results to CSV (Excel-compatible)
. esttab re_model using "../results/model_1a_results.csv", replace title("Random Effects Panel 
> Tobit Results") label se b(%9.4f) star(* 0.10 ** 0.05 *** 0.01)
(output written to ../results/model_1a_results.csv)

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:24:05
-----------------------------------------------------------------------------------------------
-----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 opened on:  21 Dec 2024, 19:24:05

. tobit prop_emne gni_per_capita broadband_per_capita mobiles_per_capita geographic_proximity c
> olonial_link, ll(0) ul(100)

Refining starting values:

Grid node 0:  Log likelihood = -196.45797

Fitting full model:

Iteration 0:  Log likelihood = -196.45797  
Iteration 1:  Log likelihood = -193.04729  
Iteration 2:  Log likelihood =  -192.8678  
Iteration 3:  Log likelihood = -192.86588  
Iteration 4:  Log likelihood = -192.86588  

Tobit regression                                    Number of obs     =     50
                                                           Uncensored =     36
Limits: Lower =   0                                     Left-censored =      5
        Upper = 100                                    Right-censored =      9

                                                    LR chi2(5)        =  14.87
                                                    Prob > chi2       = 0.0110
Log likelihood = -192.86588                         Pseudo R2         = 0.0371

--------------------------------------------------------------------------------------
           prop_emne | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------+----------------------------------------------------------------
      gni_per_capita |  -.0048842   .0099579    -0.49   0.626    -.0249406    .0151721
broadband_per_capita |   16.27357   12.40098     1.31   0.196    -8.703279    41.25042
  mobiles_per_capita |  -.2645606   .1611939    -1.64   0.108    -.5892218    .0601006
geographic_proximity |   .8601421   11.25695     0.08   0.939    -21.81252    23.53281
       colonial_link |  -37.10612   10.83472    -3.42   0.001    -58.92837   -15.28386
               _cons |   89.79618   16.28685     5.51   0.000     56.99279    122.5996
---------------------+----------------------------------------------------------------
     var(e.prop_emne)|   1208.206   309.1115                      721.6913    2022.697
--------------------------------------------------------------------------------------

. 
. * Store the results of the pooled Tobit model for later comparison
. estimates store pooled_model

. 
. log close
      name:  <unnamed>
       log:  /Users/andrewjohnston/coding_projects/nov_2024_replication_project/do_files/../res
> ults/model_1a_replication.log
  log type:  text
 closed on:  21 Dec 2024, 19:24:05
-----------------------------------------------------------------------------------------------
